r4d10n/hx-esp32-cam-fpv/esp32-gs/sdkconfig.defaults
# ESP32 FPV Ground Station SDK Configuration Defaults

# Target ESP32-S3 by default
CONFIG_IDF_TARGET="esp32s3"

# WiFi Configuration
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_RX_BA_WIN=16
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y

# Enable promiscuous mode
CONFIG_ESP_WIFI_ENABLE_PROMISCUOUS=y

# Increase task watchdog timeout
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Enable PSRAM if available
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_WS_SUPPORT=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Compiler optimizations
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# NVS
CONFIG_NVS_ENCRYPTION=n
